#จุฑามาศ สงึมรัมย์ ธด.2/2 รหัส 000
#ตัวดำเนินการเปรียบเทียบ
"""
== เท่ากับ
!= ไม่เท่ากับ
>  มากกว่า
>= มากกว่าเท่ากับ
<  น้อยกว่า
<= น้อยกว่าเท่ากับ
"""

"""
print("โปรแกรมเปรียบเทียบค่า 2 ค่า")
x = input("กรุณาใส่ค่า x :")
x = int(x)
y = input("กรุณาใส่ค่า y :")
y = int(y)
print("x=y",x==y)
print("x!=y",x!=y)
print("x>y",x>y)
print("x>=y",x>=y)
print("x<y",x<y)
print("x<=y",x<=y)"""

#------------------------------

#คำสั่งเงื่อนไข
"""if...else 1 เงื่อนไข

if คำสั่งที่เป็นจริง : #เป็นจริง
    คำสั่ง
else :           #เป็นเท็จ
    คำสั่ง
"""

"""
x = input("กรุณาใส่ค่า x :")
x = int(x)
y = input("กรุณาใส่ค่า y :")
y = int(y)
if x == y :
    print("x เท่ากับ y")
else :
    print("x ไม่เท่ากับ y")

"""

"""print("โปรแกรมแสดงการสอบผ่าน/ไม่ผ่าน")
x = input("กรุณากรอกคะแนนของคุณ :")
x = int(x)
print("คะแนนของคุณคือ",x,"คะแนน")

if x<50 :
    print("ผลสอบคือ สอบตก")
elif x>=50 :
    print("ผลสอบคือ สอบผ่าน")
else :
    print("คุณกรอกข้อมูลผิด")
"""

"""if...else 2 เงื่อนไขขึ้นไป

if คำสั่งที่เป็นจริง1 : #เป็นจริง
    คำสั่ง1
elif คำสั่งที่เป็นจริง2 :  #เป็นจริง
    คำสั่ง2
else :           #เป็นเท็จ
    คำสั่ง3"""

#จุฑามาศ สงึมรัมย์ ธด.2/2 รหัส 000
#

print("โปรแกรมคำนวณค่า BMI (ดัชนีมวลกาย)")
w = input("ป้อนน้ำหนักของคุณ (kg) :")
h = input("ป้อนส่วนสูงของคุณ (cm) :")
w = int(w)
h = int(h)

bmi = w/((h/100)**2)

#การแปรผล BMI แบบที่ 1
if bmi < 18.5 :
    print("คุณมีค่า BMI อยู่ในเกณฑ์ : น้ำหนักต่ำกว่าเกณฑ์")
elif bmi >= 18.5 and bmi <=22.9 :
    print("คุณมีค่า BMI อยู่ในเกณฑ์ : น้ำหนักสมส่วน")
elif bmi >= 23.0 and bmi <=24.9 :
    print("คุณมีค่า BMI อยู่ในเกณฑ์ : น้ำหนักเกินมาตรฐาน")
elif bmi >= 25.0 and bmi <=29.9 :
    print("คุณมีค่า BMI อยู่ในเกณฑ์ : น้ำหนักอยู่ในเกณฑ์อ้วน")
elif bmi >= 30 :
    print("คุณมีค่า BMI อยู่ในเกณฑ์ : น้ำหนักอยู่ในเกณฑ์อ้วนมาก")
else :
    print("คุณกรอกข้อมูลผิด")

#การแปรผล BMI แบบที่ 2
if bmi < 18.5 :
    x = "น้ำหนักต่ำกว่าเกณฑ์"
elif bmi >= 18.5 and bmi <=22.9 :
    x = "น้ำหนักสมส่วน"
elif bmi >= 23.0 and bmi <=24.9 :
    x = "น้ำหนักเกินมาตรฐาน"
elif bmi >= 25.0 and bmi <=29.9 :
    x = "น้ำหนักอยู่ในเกณฑ์อ้วน"
elif bmi >= 30 :
    x = "น้ำหนักอยู่ในเกณฑ์อ้วนมาก"
else :
    x = "คุณกรอกข้อมูลผิด"

print("คุณมีค่า BMI อยู่ในเกณฑ์ :",x)


