#จุฑามาศ สงึมรัมย์ ธด.2/2 รหัส 000
"""
การเขียนโปรแกรม
1.การเขียนโปรแกรมแบบลำดับขั้น
    การทำงานทีละบรรทัด
2.การเขียนโปรแกรมแบบตัดสินใจ
    การทำงานโดยมีเงื่อนไข if-else
3.การเขียนโปรแกรมแบบวนซ้ำ
    การทำงานแบบวนซ้ำไปเรื่อยๆ จนเข้าเงื่อนไขที่กำหนด
    for , while
"""

#for

"""
for ตัวแปร in range(ค่าเริ่มต้น,ค่าสิ้นสุด-1,เพิ่มค่า) :
    ค่าที่เราต้องการให้ทำซ้ำ


for i in range(1,13,1) :
    print(i)
"""
#โปรแกรมแม่สูตรคูณ

print("โปรแกรมแม่สูตรคูณแม่ 5")
for i in range(1,13,1) :
    print("5 x",i,"=",5*i)